Revit 2026 API

# RebarContainerItemHeight Property

---

For a spiral, the overall height.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; set; }
```
```vb
Public Property Height As Double
	Get
	Set
```
```cpp
public:
property double Height {
	double get ();
	void set (double value);
}
```
```fsharp
member Height : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: height must be positive. |
| InvalidOperationException | This RebarContainerItem is not an instance of a spiral shape. |

Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace